stm32-hotspot/STM32WB-BLE-Privacy/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_ResolvablePrivateAddress/STM32_WPAN/App/app_ble.c
      /* USER CODE END EVENT_PCKT */

      default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
uint8_t button_mode = 0;
uint8_t Resolving_List_Size;

/* 
 * SW1 Button: Clear resolving list (but keep bonding information), for GAP peripheral 
 * to advertise with its Static Random Address instead of a Random Private Address. 
 * This will be needed when additional new unbonded GAP Centrals want connect to 
 * this Peripheral since it is necessary to use the Static Random Address for the first 
 * connection and bonding. 
 */
void APP_BLE_Key_Button1_Action(void)
{
  tBleStatus status;
  uint8_t i;
  
  if (button_mode)
  {
    UTIL_SEQ_SetTask( 1<<CFG_TASK_READ_RPA_ID, CFG_SCH_PRIO_0);  
  }
  else
  {
    APP_DBG_MSG("\nSW1: Clear Resolving List ");
        
    /* Stop advertising necessary to clear resolving list */
    Adv_Cancel(); 
      
    /* Get bonded devices */
    status = aci_gap_get_bonded_devices(&Num_of_Addresses, &Device_Entries[0]);
    if (status == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Successful aci_gap_get_bonded_device - Num_of_Addresses: %x \n", Num_of_Addresses);     
      for (i = 0; i < Num_of_Addresses; i++) 
      {
        APP_DBG_MSG("Peer Address_Type: %x \n", Device_Entries[i].Address_Type); 
        APP_DBG_MSG("Peer Address: %02X %02X %02X %02X %02X %02X \n", Device_Entries[i].Address[5], Device_Entries[i].Address[4], Device_Entries[i].Address[3], Device_Entries[i].Address[2], Device_Entries[i].Address[1], Device_Entries[i].Address[0]); 
      }
    }
    else 
    {
      APP_DBG_MSG("Error - aci_gap_get_bonded_device - status: %x \n", status);    
    }

    /* Clear all devices from resolving list */
    for (i = 0; i < Num_of_Addresses; i++) 
    {
      status = hci_le_remove_device_from_resolving_list( Device_Entries[i].Address_Type, Device_Entries[i].Address );    
      if (status == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Successfully hci_le_remove_device_from_resolving_list\n");
      }  
    }
    
    /* Restart Advertising */
    if (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE)
    {  
      Adv_Request(APP_BLE_FAST_ADV);
    }
  }
}

/* 
 * SW2 Button: Clear all bonded device information and security database 
 */
void APP_BLE_Key_Button2_Action(void)
{
  tBleStatus status;
  uint8_t i;
  
  APP_DBG_MSG("\nSW2: Clear Bonding Table ");  
  
  /* Stop advertising necessary to clear resolving list */
  Adv_Cancel(); 
  
  /* Get bonded devices */
  status = aci_gap_get_bonded_devices(&Num_of_Addresses, &Device_Entries[0]);
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Successful aci_gap_get_bonded_device - Num_of_Addresses: %x \n", Num_of_Addresses);     
    for (i = 0; i < Num_of_Addresses; i++) 
    {
      APP_DBG_MSG("Peer Address_Type: %x \n", Device_Entries[i].Address_Type); 
      APP_DBG_MSG("Peer Address: %02X %02X %02X %02X %02X %02X \n", Device_Entries[i].Address[5], Device_Entries[i].Address[4], Device_Entries[i].Address[3], Device_Entries[i].Address[2], Device_Entries[i].Address[1], Device_Entries[i].Address[0]); 
    }
  }
  else 
  {
    APP_DBG_MSG("Error - aci_gap_get_bonded_device - status: %x \n", status);    
  }

  /* Clear bonded devices */
  for (i = 0; i < Num_of_Addresses; i++) 
  {
    status = aci_gap_remove_bonded_device(Device_Entries[i].Address_Type, Device_Entries[i].Address);
    if (status == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Successfully aci_gap_remove_bonded_device\n");
    }
    else
    {
      APP_DBG_MSG("aci_gap_clear_security_db() Failed , status: %d \n", status);
    }
  }

  /* All the devices in the security database are removed */
  status = aci_gap_clear_security_db();  
  if (status == BLE_STATUS_SUCCESS) 
  {
    APP_DBG_MSG("Successfully aci_gap_clear_security_db\n");
  }
  else
  {
    APP_DBG_MSG("aci_gap_clear_security_db() Failed , status: %d \n", status);
  } 

  /* Restart Advertising */
  if (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE)
  {  
    Adv_Request(APP_BLE_FAST_ADV);
  }  
  return;
}

/* 
 * SW3 Button: Add bonded peer device to resolving list, if any are available, 
 * for GAP peripheral to advertise with a Random Private Address
 */
void APP_BLE_Key_Button3_Action(void)
{
  tBleStatus status;
  uint8_t i; 
  
  APP_DBG_MSG("\nSW3: Add Bonded Devices to Resolving List ");

  /* Stop advertising necessary to add bonded peer device to resolving list */
  Adv_Cancel(); 
  
  /* Read address of bonded peer device */
  status = aci_gap_get_bonded_devices(&Num_of_Addresses, &Device_Entries[0]);
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Successful aci_gap_get_bonded_device - Num_of_Addresses: %x \n", Num_of_Addresses);     
    for (i = 0; i < Num_of_Addresses; i++) 
    {
      APP_DBG_MSG("Peer Address_Type: %x \n", Device_Entries[i].Address_Type); 
      APP_DBG_MSG("Peer Address: %02X %02X %02X %02X %02X %02X \n", Device_Entries[i].Address[5], Device_Entries[i].Address[4], Device_Entries[i].Address[3], Device_Entries[i].Address[2], Device_Entries[i].Address[1], Device_Entries[i].Address[0]); 
    }
  }
  else 
  {
    APP_DBG_MSG("Error - aci_gap_get_bonded_device - status: %x \n", status);    
  }

  for (i = 0; i < Num_of_Addresses; i++) 
  {  
    Whitelist_Identity_Entry_param.Peer_Identity_Address[5] = Device_Entries[i].Address[5]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[4] = Device_Entries[i].Address[4]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[3] = Device_Entries[i].Address[3]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[2] = Device_Entries[i].Address[2]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[1] = Device_Entries[i].Address[1]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[0] = Device_Entries[i].Address[0]; 
    
