stm32-hotspot/STM32WB-BLE-Privacy/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_ResolvablePrivateAddress/STM32_WPAN/App/app_ble.c
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
static void Connection_Interval_Update_Req( void )
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }
  return;
}
#endif

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  return;
}

void hci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

static void BLE_UserEvtRx( void * pPayload )
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *pParam;

  pParam = (tHCI_UserEvtRxParam *)pPayload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    pParam->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    pParam->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot( HCI_TL_CmdStatus_t status )
{
  uint32_t task_id_list;
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);

      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);

      break;

    default:
      break;
  }
  return;
}

void SVCCTL_ResumeUserEventFlow( void )
{
  hci_resume_flow();
  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
//[JT]
/*
 * Pairing Request
 */
static void Pairing_Request(void)
{
  tBleStatus status;
  status = aci_gap_slave_security_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle); 
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Successful aci_gap_slave_security_req()");
  }
  else
  {
    APP_DBG_MSG("aci_gap_slave_security_req() Failed , status: %d \n", status);
  }  
}

static void Add_To_Resolving_List()
{
  tBleStatus status;
  uint8_t i;
  
  /* Read address of bonded peer device */
  status = aci_gap_get_bonded_devices(&Num_of_Addresses, &Device_Entries[0]);
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Successful aci_gap_get_bonded_device - Num_of_Addresses: %x \n", Num_of_Addresses);     
    for (i = 0; i < Num_of_Addresses; i++) 
    {
      APP_DBG_MSG("Peer Address_Type: %x \n", Device_Entries[i].Address_Type); 
      APP_DBG_MSG("Peer Address: %02X %02X %02X %02X %02X %02X \n", Device_Entries[i].Address[5], Device_Entries[i].Address[4], Device_Entries[i].Address[3], Device_Entries[i].Address[2], Device_Entries[i].Address[1], Device_Entries[i].Address[0]); 
    }
  }
  else 
  {
    APP_DBG_MSG("Error - aci_gap_get_bonded_device - status: %x \n", status);    
  }

  for (i = 0; i < Num_of_Addresses; i++) 
  {  
    Whitelist_Identity_Entry_param.Peer_Identity_Address[5] = Device_Entries[i].Address[5]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[4] = Device_Entries[i].Address[4]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[3] = Device_Entries[i].Address[3]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[2] = Device_Entries[i].Address[2]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[1] = Device_Entries[i].Address[1]; 
    Whitelist_Identity_Entry_param.Peer_Identity_Address[0] = Device_Entries[i].Address[0]; 
    
    Whitelist_Identity_Entry_param.Peer_Identity_Address_Type = Device_Entries[i].Address_Type;  //0x00: Public Identity Address, 0x01: Random (static) Identity Address

    /* Add bonded peer device to resolving list */  
    status = aci_gap_add_devices_to_resolving_list(1,    //Num_of_Resolving_list_Entries
                                                   &Whitelist_Identity_Entry_param,  
                                                   0);    //clear_resolving_list, 0x00: Do not clear, 0x01: Clear before adding
    if (status == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Successful aci_gap_add_devices_to_resolving_list \n");        
    }
    else 
    {
      APP_DBG_MSG("Error - aci_gap_add_devices_to_resolving_list - status: %x \n", status);    
    }
  }
  
}

static void Read_Resolvable_Addr()
{
 tBleStatus status;
 static uint8_t Local_Resolvable_Address[6];
 
 /* Use last peer addres to get current RPA */
 status = hci_le_read_local_resolvable_address(Whitelist_Identity_Entry_param.Peer_Identity_Address_Type, 
                                               Whitelist_Identity_Entry_param.Peer_Identity_Address, 
                                               Local_Resolvable_Address );
 if (status == BLE_STATUS_SUCCESS)
 {
   APP_DBG_MSG("Resolvable Private Addr: %02X %02X %02X %02X %02X %02X", 
               Local_Resolvable_Address[5], 
               Local_Resolvable_Address[4], 
               Local_Resolvable_Address[3], 
               Local_Resolvable_Address[2], 
               Local_Resolvable_Address[1],
               Local_Resolvable_Address[0]);
   APP_DBG_MSG("\n");
 }
 
  
  return;
}

/* USER CODE END FD_WRAP_FUNCTIONS */
